DazzlingDukeOfLazers/soundgraph/embedded/esp32-s3/sdkconfig.defaults
# SoundGraph ESP32-S3 defaults.
#
# Assumes a DevKitC-1 N8R8 (8 MB flash, 8 MB octal PSRAM). On a quad-PSRAM variant
# (N8R2/N16R8V differ), flip CONFIG_SPIRAM_MODE_OCT to CONFIG_SPIRAM_MODE_QUAD — the
# symptom of getting it wrong is a bootloop mentioning PSRAM.

CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# Custom table: the stock large-app table's 24KB NVS cannot re-store a patch past
# ~8KB (NVS keeps old and new blobs during replacement) — see partitions.csv.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- speech recognition ---------------------------------------------------------------
# On the chip and nowhere else. The wake word is "Hi ESP" — one of the ready-made English
# models, chosen over "Alexa" because a room with an Echo in it is a room where the wrong
# device answers. The command words themselves are not here: MultiNet7 takes them at
# runtime, so they live in speech.cpp where the code that acts on them is.
#
# Chinese models are turned off explicitly. The default is a Chinese MultiNet, and
# leaving it on packs a second few megabytes into a partition sized for one language.
CONFIG_MODEL_IN_FLASH=y
CONFIG_SR_WN_WN9_HIESP=y
CONFIG_SR_MN_EN_MULTINET7_QUANT=y
CONFIG_SR_MN_CN_NONE=y

# Delay lines are the big allocations (a 2 s stereo-rate line is ~384 KB), far beyond
# internal SRAM. With SPIRAM_USE_MALLOC they land in PSRAM automatically; small hot
# allocations stay internal.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288

# The console lives on the S3's built-in USB-Serial-JTAG port. Boards like the Waveshare
# audio kit expose only USB-C, so a UART0 console would mean stdout arrives (via the
# secondary console) but stdin never does — commands sent from the host silently go
# nowhere, which is a miserable thing to debug from the outside.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
